import React from 'react'

export default function QurtionAns() {
    const datas = [
        {
            id: 1,
            qurtion: "কোর্সটি করার জন্য আগে থেকে কি কি জানতে হবে?",
            ans: "কোর্সটি করার জন্য সর্বপ্রথম যা থাকতে হবে তা হল রিডিং হ্যাবিট - বিস্তারিত কিছু লিখে দেয়া থাকলে সেগুলো পুরোটা মনোযোগ সহকারে পড়ার অভ্যাস থাকতে হবে।",
        },
        {
            id: 2,
            qurtion: "কোর্সের প্রথম ক্লাস কবে থেকে শুরু হবে?",
            ans: "কোর্সের প্রথম ক্লাস শুরু হবে জানুয়ারি 08, 2024 তারিখ রাত 11:59 মিনিট থেকে। এই সময় থেকে প্রতি সপ্তাহে এক থেকে দুইটি করে মডিউল রিলিজ দেয়া হবে।",
        },
        {
            id: 3,
            qurtion: "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে?",
            ans: "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন। তবে আপনি যদি ভিডিওগুলো স্বল্প সময়ে দেখে ফেলতে পারেন তাহলে এসাইনমেন্টের জন্য সময় বেশি পাবেন।",
        },
        {
            id: 4,
            qurtion: "কোর্সের পরীক্ষাগুলোতে কিভাবে অংশগ্রহণ করবেন?",
            ans: "প্রতিটি ভিডিওর সাথে কুইজ থাকবে এবং নিজের প্রগরেস বুঝার জন্য আপনাকে কুইজগুলোর উত্তর দিতে হবে। এছাড়া প্রতিটি মডিউল শেষে একটি করে ছোট/বড়/মাঝারি এসাইনমেন্ট থাকবে এবং আপনাদেরকে 36 ঘণ্টার মধ্যে এসাইনমেন্ট করে সোর্স কোড আমাদের গিটহাব ক্লাসরুম থেকে তৈরী করা প্রাইভেট গিটহাব রিপোসিটরি লিঙ্ক জমা দিতে হবে। এছাড়া পুরো কোর্স এর একদম শেষে একটি ফাইনাল পরীক্ষা নেয়া হবে অনলাইনে। সব এসাইনমেন্ট এবং ফাইনাল পরীক্ষার প্রাপ্ত নম্বর যোগ করে ফাইনাল রেজাল্ট নির্ধারণ করা হবে। এসাইনমেন্ট কিভাবে জমা দিবেন সেটা বিস্তারিত জানার জন্য আমাদের এই টিউটোরিয়ালটি ফলো করতে পারেন।",
        },
        {
            id: 5,
            qurtion: "কোর্সটি কতদিন চলবে?",
            ans: "কোর্সটি 1৫ সপ্তাহ মানে প্রায় সাড়ে তিন মাস চলবে। কোন রকম বড় ধরণের দূর্যোগ বা অনিবার্য পরিস্থিতি তৈরী হলে কোর্স ডিউরেশন কিছুদিন বাড়তে পারে।",
        },
        {
            id: 6,
            qurtion: "কোর্স ফি কতো?",
            ans: "আমাদের রিয়্যাক্টিভ এক্সিলারেটর - কোর্সটির ফি নির্ধারণ করা হয়েছে এককালীন 5,000 টাকা মাত্র। তবে এনরোলমেন্টের সময় আপনি যদি বাংলাদেশি মোবাইল নাম্বার ব্যবহার না করে অন্য মোবাইল নাম্বার ব্যবহার করেন তাহলে কোর্স ফি হবে এককালীন 5,100 টাকা।",
        },
        {
            id: 7,
            qurtion: "আমার প্রশ্নের উত্তর এখানে নেই। কোথায় প্রশ্ন করবো?",
            ans: "আপনি চাইলে আপনার প্রশ্নটি বিস্তারিত লিখে এবং প্রয়োজনীয় রেফারেন্স যুক্ত করে আমাদের ফেসবুক পেজে ইনবক্স করতে পারেন অথবা পাবলিক গ্রুপে পোস্ট করতে পারেন। এছাড়াও আপনার জন্য আমাদের সাপোর্ট সেন্টার এর নাম্বার - +8801325888939 সকাল 10:00 টা থেকে রাত 10:00 টা পর্যন্ত খোলা থাকবে।",
        },
    ]

    return (
        <section className='my-40'>
            <div className=" grid md:grid-cols-2 gap-16 items-center">
                <div>
                    <h1 className="font-semibold text-4xl my-8">সচরাচর জানতে চাওয়া <br/><span className='text-indigo-800'>প্রশ্নের উত্তর</span></h1>
                    <p>আপনাদের কমন কিছু প্রশ্নের উত্তর আমরা এখানে লিস্ট করে দিয়েছি। আমাদের কে প্রশ্ন করার পূর্বে এই লিস্টটি একবার পড়ে নেয়ার অনুরোধ থাকলো। তাহলে আমাদের উত্তরের জন্য আপনাকে অপেক্ষা করতে হবেনা এবং আপনার মূল্যবান সময় বেঁচে যাবে।</p>
                </div>
                <div className=" rounded overflow-hidden h-[400px] overflow-y-scroll">
                    {/* <!-- accordion-tab  --> */}
                    {
                        datas.map((data) =>
                            <div key={data.id} className="group outline-none" tabindex="1">
                                <div className="group flex justify-between px-4 py-4 items-center  transition ease duration-500 cursor-pointer pr-10 relative border-b border-b-gray-700 group-focus:bg-indigo-800 hover:bg-indigo-800 ">
                                    <div className="group-focus:text-white transition duration-500">
                                        {data.qurtion}
                                    </div>
                                    <div className="h-8 w-8 p-2 items-center inline-flex justify-center transform transition ease duration-500 group-focus:text-white group-focus:-rotate-180 absolute top-0 right-0 mb-auto ml-auto mt-2 mr-2">
                                        <svg
                                            xmlns="http://www.w3.org/2000/svg"
                                            fill="none"
                                            viewBox="0 0 24 24"
                                            stroke-width="1.5"
                                            stroke="currentColor">
                                            <path
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M19.5 8.25l-7.5 7.5-7.5-7.5" />
                                        </svg>
                                    </div>
                                </div>
                                <div className="group-focus:max-h-screen max-h-0 bg-gray-800 px-4 overflow-hidden ease duration-500">
                                    <p className="p-2 py-4 pr-8 text-gray-400 text-justify">
                                        {data.ans}
                                    </p>
                                </div>
                            </div>
                        )
                    }
                </div>
            </div>
        </section>
    )
}
